app/Services/BbtsGlobalService.php

select * from `departments`
---
    public function getDepartments() {
        return Department::all();

select * from `support_complain_types`
---
    public function getComplainTypes() {
        return SupportComplainType::all();

select * from `ticket_sources`
---
    public function getTicketSources() {
        return TicketSource::all();

select * from `support_tickets` where `support_tickets`.`id` = '16' limit 1
select * from `ticket_movements` where `support_ticket_id` = '2' and (`type` = 'Forward' and `status` = 'Accepted' and `accepted_by` = 6) limit 1
---
    public function isEligibleForTicketMovement($ticketId, $movementType) {

        $supportTicket = SupportTicket::findOrFail($ticketId);

        if($supportTicket->status == 'Closed' || $supportTicket->status == 'Pending') {
            return false;
        }

        $movementTypes = config('businessinfo.ticketMovements'); // Forward, Backward, Handover

        if($movementTypes[0] == $movementType) {
            $acceptedUserId = $supportTicket->supportTicketLifeCycles->where('status', 'Accepted')->first()->user_id;

            if($acceptedUserId == auth()->user()->id) {
                return true;
            } else {
                return false;
            }
        } else if($movementTypes[1] == $movementType) {
            $forwardedTicketAccepter = TicketMovement::where('support_ticket_id', $ticketId)
                                                    ->where([
                                                        'type'=> $movementTypes[0],
                                                        'status' => 'Accepted',
                                                        'accepted_by' => auth()->user()->id
                                                        ])
                                                    ->first();

select * from `support_teams`
---
    public function getSupportTeam() {
        return SupportTeam::get();

select * from `support_teams`
---
    public function getThirdLayerSupportTeam() {
        return SupportTeam::get();

select * from `support_team_members` where `user_id` = 6
select * from `support_team_members` where `user_id` = 9
select * from `support_teams`
select * from `ticket_movements` where (`movement_model` = '\Modules\Ticketing\Entities\SupportTeam' and `movement_to` in (1) or (`movement_model` = '\Modules\Admin\Entities\User' and `movement_to` = 6)) and `type` = 'Forward' order by `created_at` desc
---
    public function filterTicketsBasedOnMovement($request, $movementType) {
        $from = $request->date_from;
        $to = $request->date_to;
        $supportTicketId = $request->ticket_no;

        $userSupportTeam = SupportTeamMember::where('user_id', auth()->user()->id)->get();
        /*
            The line is eloquent get() method but not first(),
            because each member might belong to multiple team as Mr. Humayun said.
        */

        $teamIds = $userSupportTeam->map(function($teamMember) {
            return $teamMember->support_team_id;
        })->toArray();

        $ticketNo = '';
        if(!empty($supportTicketId)) {
            $ticketNo = SupportTicket::findOrFail($supportTicketId)->ticket_no;
        }

        $supportTicketMovements = TicketMovement::where(function($query) use($teamIds) {
                                        $query->where('movement_model', '\Modules\Ticketing\Entities\SupportTeam')
                                            ->whereIn('movement_to', $teamIds)
                                            ->orWhere(function($subquery) {
                                                        $subquery->where('movement_model', '\Modules\Admin\Entities\User')
                                                                ->where('movement_to', auth()->user()->id);
                                            });
                                    })
                                    ->where('type', $movementType)
                                    ->when(!empty($from), function($fromQuery) use($from) {
                                        $fromQuery->whereDate('created_at', '>=', Carbon::parse($from)->startOfDay());
                                    })
                                    ->when(!empty($to), function($toQuery) use($to) {
                                        $toQuery->whereDate('created_at', '<=', Carbon::parse($to)->endOfDay());
                                    })
                                    ->when(!empty($supportTicketId), function($ticketNoQuery) use($supportTicketId) {
                                        $ticketNoQuery->where('support_ticket_id', $supportTicketId);
                                    })
                                    ->orderBy('created_at', 'desc')
                                    ->get();