app/Http/Controllers/Dataencoding/EmployeeController.php

select * from `departments` where `departments`.`id` in (1, 2)
select * from `designations` where `designations`.`id` in (2)
select * from `employees` order by `created_at` desc
---
    public function index()

    {
//        $test=Employee::with('preThana','preThana.district')->get();
//        dd($test);
        $employees=Employee::with('designation','department')->latest()->get();