Modules/Admin/Http/Controllers/AuthController.php

    public function login(Request $request)
    {
        $credentials = $request->only(['email', 'password']);

        if (!Auth::attempt($credentials)) {
            return redirect()->back()->withErrors(['message' => 'Invalid email or password']);
        }

        $user = User::where('email', $request->email)->first();
---
select * from `users` where `email` = 'level2-support@bbts.net' limit 1