Modules/Admin/Http/Controllers/RoleController.php

select * from `roles` order by `name` asc
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (1, 2, 3, 4, 5, 6, 7, 8, 10, 11, 12)
---
    public function index()
    {
        $roles = Role::with('permissions')->orderBy('name', 'ASC')->get();

select * from `permissions` order by `name` asc
---
    public function create()
    {
        $formType = "create";
        $permissions = Permission::orderBy('name')->get();

select * from `permissions` order by `name` asc
select `role_has_permissions`.`permission_id`, `role_has_permissions`.`permission_id` from `role_has_permissions` where `role_has_permissions`.`role_id` = 10
---
    public function edit(Role $role)
    {
        $formType = "edit";
        $permission = Permission::orderBy('name')->get();
        $permissions = Permission::orderBy('name')->get();

        $rolePermissions = DB::table("role_has_permissions")->where("role_has_permissions.role_id", $role->id)
            ->pluck('role_has_permissions.permission_id', 'role_has_permissions.permission_id')
            ->all();