Modules/Admin/Http/Controllers/UserController.php

    public function index()
    {
        $users = User::latest()->get();
---
select * from `users` order by `created_at` desc

    public function create()
    {
        $formType = "create";
        $roles = Role::orderBy('name')->pluck('name', 'id');
        $departments = Department::orderBy('name')->pluck('name','id');
        $employees = Employee::orderBy('name')->get(['name', 'id'])->pluck('fullName', 'id');
---
select `name`, `id` from `roles` order by `name` asc
select `name`, `id` from `departments` order by `name` asc
select `name`, `id` from `employees` order by `name` asc

    public function store(Request $request)
    {
        // dd($request->input('role'));
        try{
            Validator::make($request->all(), [
                'email' => 'required|email|unique:users,email',
                'password' => 'required|same:confirm-password',
            ])->validate();

            $input = $request->all();
            $input['password'] = Hash::make($request['password']);

            DB::transaction(function() use($input, $request) {
                $user = User::create($input);
---
insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('jaber-1234', 'level1-support@bbts.net', '$2y$10$LWUtYJJjJXbDEMUir2vV2eg4YB4qgiBsMGuR3fzDGRX50EwGNDPGu', '2023-09-26 09:51:56', '2023-09-26 09:51:56')

    public function edit(User $user)
    {
        $formType = "edit";
        $roles = Role::orderBy('name')->pluck('name', 'id');
        $departments=Department::orderBy('name')->pluck('name','id');

        $employees = Employee::orderBy('name')->get();
---
select `name`, `id` from `roles` order by `name` asc
select `name`, `id` from `departments` order by `name` asc
select * from `employees` order by `name` asc