app/Http/Controllers/CommonApiController.php

select * from `feasibility_requirement_details` where `feasibility_requirement_details`.`client_no` in ('2023-1', '2023-11', '2023-12', '2023-13', '2023-15')
---
    public function getClientsByLinkId()
    {
        $results = Client::query()
            ->with('feasibility_requirement_details')
            ->where(function ($query) {
                $search = request('search');
                $query->where('client_no', 'LIKE', '%' . $search . '%')
                    ->orWhere('client_name', 'LIKE', '%' . $search . '%');
            })
            ->limit(15)
            ->get()
            ->map(function ($item) {
                return [
                    'id' => $item->client_no,
                    'text' => $item->client_no . ' - ' . $item->client_name,
                    'client_name' => $item->client_name,
                    'contact_person' => $item->contact_person,
                    'contact_no' => $item->contact_no,
                    'email' => $item->email,
                    'client_type' => $item->client_type,
                    'address' => $item->location,
                    'fr_list' => $item->feasibility_requirement_details->pluck('fr_no', 'connectivity_point'),
                ];
            });

select * from `support_complain_types` where `support_complain_types`.`id` in (3)
select * from `ticket_sources` where `ticket_sources`.`id` in (2)
select `support_complain_type_id`, `ticket_source_id`, `status`, `opening_date`, `remarks`, `id`, `ticket_no` from `support_tickets` where `fr_no` = 'fr-2023-13-1' order by `id` desc limit 5
---
    public function getClientsPreviousTickets($frNo, $limit)
    {
        $limit = (abs($limit) > 5) ? 5 : abs($limit);

        $previousTickets = SupportTicket::where('fr_no', $frNo)
            ->with(['supportComplainType', 'ticketSource'])
            ->limit($limit)
            ->orderBy('id', 'desc')
            ->get(['support_complain_type_id', 'ticket_source_id', 'status', 'opening_date', 'remarks', 'id', 'ticket_no']);

select * from `support_team_members` where `support_team_members`.`support_team_id` in (1)
select * from `support_teams` where `id` = '1' limit 1
select * from `users` where `users`.`id` in (5, 6)
---
    public function getSupportTeamMembers()
    {
        $teamId = request('search');
        $team = SupportTeam::with('supportTeamMembers.user')->where('id', $teamId)->first();

select * from `support_tickets` where `ticket_no` LIKE '%1%' limit 15
---
    public function getSupportTicket()
    {
        $results = SupportTicket::query()
            ->where('ticket_no', 'LIKE', '%' . request('search') . '%')
            ->limit(15)
            ->get()
            ->map(fn ($item) => [
                'id' => $item->id,
                'text' => $item->ticket_no,
                'value' => $item->id,
                'label' => $item->ticket_no,
            ]);

select * from `physical_connectivities` where `client_no` = '2023-13' and `fr_no` = 'fr-2023-13-2' limit 1
---
    public function getLinksByFr($client_no, $fr_no)
    {
        $results = PhysicalConnectivity::with('lines')->where('client_no', $client_no)->where('fr_no', $fr_no)->first();