Modules/Ticketing/Http/Controllers/ReportController.php

    public function index(Request $request)
    {
        $from = $request->date_from;
        $to = $request->date_to;
        $status = $request->status;

        $source = $request->ticket_source_id;
        $problemType = $request->support_complain_type_id;
        $priority = $request->priority;

        $popId = $request->pop_id;
        $clientId = $request->client_id;
        $duration = null;

        if ($clientId) {
            $clientId = Client::where('id', $clientId)->first()->client_no;
        }

        if (!empty($request->duration)) {
            $duration = (new BbtsGlobalService())->convertToMinutes($request->duration);
        }

        $supportTickets = SupportTicket::when(!empty($from), function ($fromQuery) use ($from) {
            $fromQuery->whereDate('created_at', '>=', Carbon::parse($from)->startOfDay());
        })
            ->when(!empty($to), function ($toQuery) use ($to) {
                $toQuery->whereDate('created_at', '<=', Carbon::parse($to)->endOfDay());
            })
            ->when(!empty($status), function ($statusQuery) use ($status) {
                $statusQuery->where('status', $status);
            })
            ->when(!empty($source), function ($sourceQuery) use ($source) {
                $sourceQuery->where('ticket_source_id', $source);
            })
            ->when(!empty($problemType), function ($problemTypeQuery) use ($problemType) {
                $problemTypeQuery->where('support_complain_type_id', $problemType);
            })
            ->when(!empty($priority), function ($priorityQuery) use ($priority) {
                $priorityQuery->where('priority', $priority);
            })
            ->when(!empty($popId), function ($popIdQuery) use ($popId) {
                $popIdQuery->where('pop_id', $popId);
            })
            ->when(!empty($clientId), function ($clientIdQuery) use ($clientId) {
                $clientIdQuery->where('client_no', $clientId);
            })
            ->when(!empty($duration), function ($durationQuery) use ($duration) {
                $durationQuery->where('duration', '<=', $duration);
            })
            ->when(!empty($request->search_by_days), function ($searchByDaysQuery) use ($request) {
                $searchByDaysQuery->where('created_at', '>=', now()->subDays($request->search_by_days));
            })
            ->orderBy('created_at', 'desc')
            ->get();

        $ticketSources = (new BbtsGlobalService())->getTicketSources();
        $complainTypes = (new BbtsGlobalService())->getComplainTypes();
        $popInfo = Pop::where('id', $popId)->first();
        $clientInfo = Client::select('id', 'client_name')->where('id', $clientId)->first();
---
select * from `support_tickets` order by `created_at` desc
select * from `pops` where `id` is null limit 1
select `id`, `client_name` from `clients` where `id` is null limit 1