Modules/Ticketing/Http/Controllers/SupportTicketController.php

select * from `support_tickets` where `support_tickets`.`id` = '2' limit 1
select * from `support_tickets` where date(`created_at`) >= '2023-09-08' and `id` = '15' order by `created_at` desc
---
    public function index(Request $request)
    {
        $from = $request->date_from;
        $to = $request->date_to;
        $supportTicketId = $request->ticket_no;
        $ticketNo = '';
        if (!empty($supportTicketId)) {
            $ticketNo = SupportTicket::findOrFail($supportTicketId)->ticket_no;
        }

        $supportTickets = SupportTicket::when(!empty($from), function ($fromQuery) use ($from) {
            $fromQuery->whereDate('created_at', '>=', Carbon::parse($from)->startOfDay());
        })
            ->when(!empty($to), function ($toQuery) use ($to) {
                $toQuery->whereDate('created_at', '<=', Carbon::parse($to)->endOfDay());
            })
            ->when(!empty($supportTicketId), function ($ticketNoQuery) use ($supportTicketId) {
                $ticketNoQuery->where('id', $supportTicketId);
            })
            ->when(!empty($request->search_by_days), function ($query) use ($request) {
                $query->whereDate('created_at', '>=', Carbon::now()->subDays($request->search_by_days)->startOfDay());
            })
            ->when(!empty($request->search_by_status), function ($query) use ($request) {
                $query->where('status', $request->search_by_status);
            })
            ->orderBy('created_at', 'desc')
            ->get();

select * from `clients` where `client_no` = '2023-13' limit 1
---
    public function store(SupportTicketRequest $request)
    {
        $clientInfo = Client::where('client_no', $request->client_no)->first();

select `id`, `client_no`, `email`, `client_name`, `contact_person`, `location`, `contact_no` from `clients` where `clients`.`client_no` in ('1')
select * from `support_quick_solutions`
---
    public function show(SupportTicket $supportTicket)
    {
        $complainTypes = (new BbtsGlobalService())->getComplainTypes();
        $ticketSources = (new BbtsGlobalService())->getTicketSources();
        $supportTicket->load(['client' => function ($query) {
            $query->select('id', 'client_no', 'email', 'client_name', 'contact_person', 'location', 'contact_no');
        }]);

        $quickSolutions = SupportQuickSolution::get();

select * from `support_tickets` where `support_tickets`.`id` = '16' limit 1
update `support_tickets` set `status` = 'Accepted', `support_tickets`.`updated_at` = '2023-09-26 11:38:46' where `id` = 16
insert into `support_ticket_life_cycles` (`status`, `user_id`, `support_ticket_id`, `remarks`, `updated_at`, `created_at`) values ('Accepted', 5, 16, 'Ticket Accepted.', '2023-09-26 11:38:46', '2023-09-26 11:38:46')
---
    public function acceptTicket(Request $request)
    {

        if (!empty($request->ticket_id)) {
            try {
                $ticket = SupportTicket::findOrFail($request->ticket_id);
            } catch (\Throwable $th) {
                return back()->withErrors([
                    'message' => 'Invalid Ticket. Your IP is logged in the system.'
                ]);
            }

            if ($ticket->status == 'Pending' || $ticket->status == 'Approved') {
                $ticket->status = 'Accepted';

                try {
                    DB::transaction(function () use ($ticket) {
                        $ticket->save();

                        $ticket->supportTicketLifeCycles()->create([
                            'status' => 'Accepted',
                            'user_id' => auth()->user()->id,
                            'support_ticket_id' => $ticket->id,
                            'remarks' => 'Ticket Accepted.'
                        ]);