Modules/Ticketing/Http/Controllers/TicketDashboardController.php

select * from `support_tickets` where date(`created_at`) >= '2023-09-01' and date(`created_at`) <= '2023-09-30' order by `created_at` desc
select * from `ticket_sources` where `id` in (3)
select *, DATE(created_at) as date from `support_ticket_life_cycles` where date(`created_at`) >= '2023-09-01' and date(`created_at`) <= '2023-09-30'
---
    public function index(Request $request)
    {
        $from = $request->date_from;
        $to = $request->date_to;

        $supportTickets = SupportTicket::when(!empty($from), function($fromQuery) use($from) {
                                $fromQuery->whereDate('created_at', '>=', Carbon::parse($from)->startOfDay());
                            })
                            ->when(!empty($to), function($toQuery) use($to) {
                                $toQuery->whereDate('created_at', '<=', Carbon::parse($to)->endOfDay());
                            })
                            ->orderBy('created_at', 'desc')
                            ->get();

        $ticketSourcesId = $supportTickets->pluck('ticket_source_id')->unique()->values()->all();
        $sources = TicketSource::whereIn('id', $ticketSourcesId)->get();

        $supportTicketLifeCycles = SupportTicketLifeCycle::when(!empty($from), function($fromQuery) use($from) {
                            $fromQuery->whereDate('created_at', '>=', Carbon::parse($from)->startOfDay());
                        })
                        ->when(!empty($to), function($toQuery) use($to) {
                            $toQuery->whereDate('created_at', '<=', Carbon::parse($to)->endOfDay());
                        })
                        ->selectRaw('*, DATE(created_at) as date')
                        ->get()
                        ->groupBy('date')->map(function($item) {
                            return $item->groupBy('status');
                        });