Modules/Ticketing/Http/Controllers/TicketMovementController.php

    public function acceptForwardedTickets(Request $request) {
        $userSupportTeam = SupportTeamMember::where('user_id', auth()->user()->id)->get();
        // The line is get method, because each member might belong to multiple team as Mr. Humayun said.

        $teamIds = $userSupportTeam->map(function($teamMember) {
            return $teamMember->support_team_id;
        })->toArray();
---
select * from `support_teams` limit 1