Modules/Ticketing/Http/Controllers/TicketMovementController.php

select * from `support_tickets` where `support_tickets`.`id` = '1' limit 1
select * from `support_team_members` where `user_id` = 5
select * from `support_team_members` where `support_team_members`.`support_team_id` in (1, 4)
select * from `support_teams` where `support_teams`.`id` in (1, 4)
select * from `users` where `id` in (6, 8)
---
    public function moveTicket(Request $request, $movementType, $ticketId) {
        $movementTypes = config('businessinfo.ticketMovements');

        if(!in_array($movementType, $movementTypes)) {
            abort(404);
        }

        $supportTicket = SupportTicket::findOrFail($ticketId);

        $isEligible = (new BbtsGlobalService())->isEligibleForTicketMovement($ticketId, $movementType);

        if(!$isEligible) {
            return redirect()->route('support-tickets.show',$ticketId)->withErrors('Ticket is Pending or already closed. Or you are not eligible to move this ticket.');
        }

        $supportTeams = (new BbtsGlobalService())->getSupportTeam();

        $sameTeamUsers = [];

        // Handover is 2 in array
        if($movementType == $movementTypes[2]) {
            $userTeam = SupportTeamMember::with('supportTeam.supportTeamMembers')
                        ->where('user_id', auth()->user()->id)
                        ->get();

            $sameTeamUserIds = $userTeam->flatMap(function($teamMember) {
                                        return $teamMember->supportTeam->supportTeamMembers->reject(function($user) {
                                        return $user->user_id == auth()->user()->id;
                                    });
                                })->pluck('user_id')->unique()->values()->toArray();

            $sameTeamUsers = User::whereIn('id', $sameTeamUserIds)->get();

select * from `support_tickets` where `support_tickets`.`id` = '16' limit 1
---
    public function processTicketMovement(Request $request, $movementType, $ticketId) {
        $movementTypes = config('businessinfo.ticketMovements'); // Forward, Backward, Handover
        $pastForms = collect(config('businessinfo.pastForms'));

        try {
            if(!in_array($movementType, $movementTypes) || $movementType != $movementTypes[0]) {
                abort(404);
            }

            $supportTicket = SupportTicket::findOrFail($ticketId);

select * from `departments` where `departments`.`id` = 5 limit 1
select * from `users` where `users`.`id` = 6 limit 1
---
                    return back()->withErrors('You cannot forward ticket to this user. Because Team and Employee mismatch.');
                }

                $remarks = 'Ticket '.$pastForms[$movementType].' to '.$teamMember->user->name.' of '.$supportTeam->first()->department->name.'.';

insert into `support_ticket_life_cycles` (`status`, `user_id`, `support_ticket_id`, `remarks`, `description`, `updated_at`, `created_at`) values ('Processing', 5, 16, 'Ticket Forwarded to Sajid - Level 3 of Accounts.', 'see now', '2023-09-26 12:54:55', '2023-09-26 12:54:55')
insert into `ticket_movements` (`support_ticket_id`, `type`, `movement_to`, `movement_by`, `status`, `remarks`, `movement_model`, `movement_date`, `updated_at`, `created_at`) values (16, 'Forward', '6', 5, 'Pending', 'see now', '\Modules\Admin\Entities\User', '2023-09-26 12:54:55', '2023-09-26 12:54:55', '2023-09-26 12:54:55')
---
                        'status' => 'Processing'
                    ]);

                    $supportTicket->supportTicketLifeCycles()->create([
                        'status' => 'Processing',
                        'user_id' => auth()->user()->id,
                        'support_ticket_id' => $supportTicket->id,
                        'remarks' => $remarks,
                        'description' => $request->remarks

                    ]);

                    TicketMovement::create([
                        'support_ticket_id' => $supportTicket->id,
                        'type' => $movementType,
                        'movement_to' => (!empty($request->teamMemberId)) ? $request->teamMemberId : $request->movement_to,
                        'movement_by' => auth()->user()->id,
                        'status' => 'Pending',
                        'remarks' => $request->remarks,
                        'movement_model' => $movementModel,
                        'movement_date' => now(),
                    ]);

select * from `departments` where `departments`.`id` = 5 limit 1
---

                foreach($mailReceivers as $mailReceiver) {
                    $subject = 'Ticket '.$supportTicket->ticket_no.' '. ucfirst($movementType);
                    $message = 'Ticket: '.$supportTicket->ticket_no.' '.$pastForms[$movementType].' to '.$supportTeam->first()->department->name.'.';

select * from `departments` where `departments`.`id` = 5 limit 1
---
                }

                foreach($notificationReceivers as $notificationReceiver) {
                    $message = 'Ticket: '.$supportTicket->ticket_no.' '.$pastForms[$movementType].' to '.$supportTeam->first()->department->name.'.';

select * from `support_tickets` where `support_tickets`.`id` = '2' limit 1
select * from `users` where `users`.`id` = 5 limit 1
insert into `support_ticket_life_cycles` (`status`, `user_id`, `support_ticket_id`, `remarks`, `description`, `updated_at`, `created_at`) values ('Processing', 6, 2, 'Ticket Backwarded to Mahmud - Level 2 of Systems & Services.', 'Backward from Sajid 3', '2023-09-26 14:42:51', '2023-09-26 14:42:51')
---
    public function processTicketMovementBackward(Request $request, $movementType, $ticketId) {
        $movementTypes = config('businessinfo.ticketMovements'); // Forward, Backward, Handover
        $pastForms = collect(config('businessinfo.pastForms'));

        try {
            if(!in_array($movementType, $movementTypes) || $movementType != $movementTypes[1]) {
                abort(404);
            }

            $supportTicket = SupportTicket::findOrFail($ticketId);

            $isEligible = (new BbtsGlobalService())->isEligibleForTicketMovement($ticketId, $movementType);

            if(!$isEligible) {
                return back()->withErrors('Ticket is Pending or already closed. Or you are not eligible to move this ticket.');
            }

            $movementModel = '\Modules\Admin\Entities\User';

            $authorizedMember = $supportTicket->supportTicketLifeCycles->where('status', 'Accepted')->first();

            $remarks = 'Ticket '.$pastForms[$movementType].' to '.$authorizedMember->user->name.' of '.$authorizedMember->user->employee->department->name.'.';

            $permissionNames = ['receive-email-when-ticket-forwarded', 'receive-email-when-ticket-backwarded', 'receive-email-when-ticket-handovered'];

            $mailReceivers = User::whereIn('id', [$authorizedMember->user_id])->whereHas('roles', function($q) use($permissionNames){
                $q->whereHas('permissions', function($q1) use($permissionNames) {
                  $q1->whereIn('name', $permissionNames);
                });
              })->get();

            try {
                DB::transaction(function() use($supportTicket, $remarks, $movementModel, $movementType, $request, $authorizedMember) {
                    $supportTicket->supportTicketLifeCycles()->create([
                        'status' => 'Processing',
                        'user_id' => auth()->user()->id,
                        'support_ticket_id' => $supportTicket->id,
                        'remarks' => $remarks,
                        'description' => $request->remarks
                    ]);

insert into `ticket_movements` (`support_ticket_id`, `type`, `movement_to`, `movement_by`, `status`, `remarks`, `movement_model`, `movement_date`, `updated_at`, `created_at`) values (2, 'Backward', 5, 6, 'Processing', 'Backward from Sajid 3', '\Modules\Admin\Entities\User', '2023-09-26 14:42:52', '2023-09-26 14:42:52', '2023-09-26 14:42:52')
---
                        'status' => 'Processing',
                    ]);

                    TicketMovement::create([
                        'support_ticket_id' => $supportTicket->id,
                        'type' => $movementType,
                        'movement_to' =>$authorizedMember->user_id,
                        'movement_by' => auth()->user()->id,
                        'status' => 'Processing',
                        'remarks' => $request->remarks,
                        'movement_model' => $movementModel,
                        'movement_date' => now(),
                    ]);
                });

select * from `users` where `users`.`id` = 5 limit 1
---

                if ($authorizedMember->hasPermissionTo('receive-in-app-notification-when-ticket-backwarded')) {
                    $notificationMessage = 'Ticket: '.$supportTicket->ticket_no.' '.$pastForms[$movementType].' from '.auth()->user()->name.'.';
                    $notificationReceiver = User::where('id', $authorizedMember->user_id)->first();

select * from `support_team_members` where `user_id` = 6
select * from `ticket_movements` where `ticket_movements`.`id` = '97' limit 1
select * from `users` where `id` = 5 limit 1
insert into `support_ticket_life_cycles` (`status`, `user_id`, `support_ticket_id`, `remarks`, `updated_at`, `created_at`) values ('Processing', 6, 16, 'Forwarded Ticket Accepted by Sajid - Level 3 of Sales & Marketing.', '2023-09-26 14:26:51', '2023-09-26 14:26:51')
select * from `departments` where `departments`.`id` = 1 limit 1
select * from `employees` where `employees`.`id` = 2 limit 1
update `ticket_movements` set `accepted_by` = 6, `status` = 'Accepted', `ticket_movements`.`updated_at` = '2023-09-26 14:26:51' where `id` = 97
---
    public function acceptForwardedTickets(Request $request) {
        $userSupportTeam = SupportTeamMember::where('user_id', auth()->user()->id)->get();
        // The line is get method, because each member might belong to multiple team as Mr. Humayun said.

        $teamIds = $userSupportTeam->map(function($teamMember) {
            return $teamMember->support_team_id;
        })->toArray();

        $movement = TicketMovement::findOrFail($request->movement_id);

        if($movement->movement_model == '\Modules\Ticketing\Entities\SupportTeam') {
            if(!in_array($movement->movement_to, $teamIds)) {
                return redirect()->back()->withErrors('You are not eligible to accept this ticket.');
            }
        } else {
            if(!in_array($movement->movement_to, [auth()->user()->id])) {
                return redirect()->back()->withErrors('You are not eligible to accept this ticket.');
            }
        }

        try {
            DB::transaction(function() use($movement) {
                $movement->supportTicket->supportTicketLifeCycles()->create([
                    'status' => collect($movement->supportTicket->supportTicketLifeCycles)->last()->status,
                    'user_id' => auth()->user()->id,
                    'support_ticket_id' => $movement->support_ticket_id,
                    'remarks' => 'Forwarded Ticket Accepted by '.auth()->user()->name.' of '.auth()->user()->employee->department->name.'.'
                ]);

                $movement->update([
                    'status' => 'Accepted',
                    'accepted_by' => auth()->user()->id
                ]);
            });